In [135]:
import pandas as pd
import os
from google.colab import drive

In [136]:
pd.set_option('display.max_columns', None)
# display.[max_categories, max_columns, max_colwidth, max_dir_items,
#   max_info_columns, max_info_rows, max_rows, max_seq_items, memory_usage,
#   min_rows, multi_sparse, notebook_repr_html, pprint_nest_depth, precision,
#   show_dimensions]

In [ ]:
path = './drive/MyDrive/Colab Notebooks/'

In [ ]:
# 나의 구글 드라이브 연결
drive.mount("/content/drive")

Mounted at /content/drive

# 데이터 불러오기

In [ ]:
# 둘레길 관심인구 정보
df1 = pd.read_csv(path + "FPL010101.csv")
# 둘레길 주변관광 이용자 정보
df2 = pd.read_csv(path + "FPL010401.csv")
# 둘레길 선호 관광 장소
df3 = pd.read_csv(path + "FPL010501.csv")
# 둘레길 관심인구 관심사/관심분야 (포털 검색 분야) 정보
df4 = pd.read_csv(path + "FPL010801.csv")
# 둘레길 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보)
df5 = pd.read_csv(path + "FPL010901.csv")

# 등산로 관심인구 정보
df6 = pd.read_csv(path + "FPL020101.csv")
# 등산로 선호 관광 장소
df7 = pd.read_csv(path + "FPL020501.csv")
# 등산로 관심인구 관심사/관심분야 (포털 검색 분야) 정보
df8 = pd.read_csv(path + "FPL020801.csv")

# 국립공원 관심인구 정보
df9 = pd.read_csv(path + "FPL030101.csv")
# 국립공원 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보)
df10 = pd.read_csv(path + "FPL030701.csv")

# 자전거코스/자전거길 관심인구 정보
df11 = pd.read_csv(path + "FPL040101.csv")
# 자전거코스/자전거길 관심인구 자전거용품 검색 정보
df12 = pd.read_csv(path + "FPL040401.csv")

# 산림치유원 관심인구 선호 산림치유원 검색 정보
df13 = pd.read_csv(path + "FPL050201.csv")
# 산림체험 관심인구 정보
df14 = pd.read_csv(path + "FPL060101.csv")
# 산림체험 관심인구 선호 산림체험장소 검색 정보
df15 = pd.read_csv(path + "FPL060201.csv")
# 산림체험 관심인구 선호 산림체험 프로그램 검색 정보
df16 = pd.read_csv(path + "FPL060301.csv")

# 산림치유 관심인구 라이프스타일 (온라인쇼핑몰 검색/구매 카테고리) 정보
df17 = pd.read_csv(path + "FPL060501.csv")

# 귀산촌 관심인구 정보
df18 = pd.read_csv(path + "FPL070101.csv")

# 산림재해 관심인구 정보
df19 = pd.read_csv(path + "FPL080101.csv")
# 산림대피소 관심인구 정보
df20 = pd.read_csv(path + "FPL080201.csv")
# 산림재해 관심인구 관심지역 검색정보
df21 = pd.read_csv(path + "FPL080301.csv")
# 산림재해 연관 검색 키워드를 검색한 관심인구 정보
df22 = pd.read_csv(path + "FPL080401.csv")

# 전국 국립공원 등산로 이용자 분류(성/연령)별 평균 칼로리 소모량 정보
df23 = pd.read_csv(path + "PARK_KCAL.csv")

# 둘레길[circumference trekking way]
> 거주 지역, 명소 따위의 주변에 난 길을 말한다.산책을 위한 길이 일반적이다.

### df1 : 둘레길 관심인구 정보 (Total : 44,373)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|둘레길 | 서울 둘레길 | 영남 알프스 | 지리산 둘레길 | 북한산 둘레길 | 영덕 블루로드 |
|거주지23| 서울 | 경기 | 부산 | 인천 | 대구 |
|거주지456| 서울 | 경기 | 인천 | 부산 | 대구 |


|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|17,936(40.4%)|5,143(28.7%)|7,390(41.2%)|
|20|5,417(12.2%)|554(3.1%)|1,172(6.5%)|
|30|12,499(28.2%)|4,589(25.6%)|6,218(34.7%)|

---

### df2 : 둘레길 주변관광 이용자 정보 (Total : 9,468)
### df3 : 둘레길 선호 관광 장소

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 23| 서울 | 경기 | 부산 | 인천 | 대구 |
|주변관광 23 | 울릉도 | 해운대 | 남원 | 안면도 | 죽도 |
|주변관광 2 | 울릉도 | 해운대 | 죽도 | 남원 | 한탄강 |
|주변관광 3 | 해운대 | 울릉도 | 남원 | 안면도 | 태종대 |
||||||
|거주지 45| 서울 | 경기 | 인천 | 부산 | 대구 |
|주변관광 45 | 해운대 | 울릉도 | 남원 | 안면도 | 한탄강 |

`[2-30] 여 : 2,381(58.3%), 남 : 1,705(41.7%)`


|Age|이용인구|Car|job|
|--|--|--|--|
|2-30|4,086(43.2%)|1,275(31.2%)|943(23.1%)|
|20|1,204(12.7%)|130(3.2%)|397(9.7%)|
|30|2,882(30.4%)|1,145(28.0%)|546(13.4%)|

---

### df4 : 둘레길 관심인구 관심사/관심분야 (포털 검색 분야) 정보 (Total : 156,516)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 23| 서울 | 경기 | 인천 | 경남 | 대구 |
|주요 관심 23(서울) | TV연예 | 사회 | 스포츠 | 경제 | 정치 |
|거주지 2| 경기 | 서울 | 부산 | 인천 | 경북 |
|주요 관심 2(경기) | 사회 | 정치 | TV연예 | 스포츠 | 정치 |
|거주지 3| 서울 | 경기 | 인천 | 경남 | 대구 |
|주요 관심 3(서울) | TV연예 | 사회 | 스포츠 | 경제 | 정치 |

`[2-30] 여 : 38,858(59.8%), 남 : 26,154(40.2%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|65,012(41.5%)|25,614(39.4%)|33,350(51.3%)|
|20|14,883(9.5%)|3,167(4.9%)|4,039(6.2%)|
|30|50,129(32.0%)|22,447(34.5%)|27,469(42.3%)|

---

### df5 : 둘레길 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보) (Total : 68,606)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 23| 서울 | 경기 | 부산 | 대구 | 인천 |
|관심 카데고리 23(서울) | 식품/건강 | 패션의류 | 생활/주방 | 뷰티 | 패션잡화 |
|거주지 2| 부산 | 서울 | 경기 | 인천 | 대구 |
|관심 카데고리 2(부산) | 패션의류 | 패션잡화 | 식품/건강 | 뷰티 | 디지털/가전 |
|거주지 3| 서울 | 경기 | 대구 | 인천 | 부산 |
|관심 카데고리 3(서울) | 식품/건강 | 패션의류 | 생활/주방 | 뷰티 |

`[2-30] 여 : 21,268(65.9%), 남 : 1102(34.1%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|32,292(47.1%)|10,957(33.9%)|16,129(49.9%)|
|20|8,887(13.0%)|647(2.0%)|3,851(11.9%)|
|30|23,405(34.1%)|10,310(31.9%)|12,278(38.0%)|

1. 부모랑 같이 살아서  
2. 부모랑 같이 가서  
3. 자동차 외에는 교통수단 제외(오토바이)
4. 해외가 부담이여서

---
---
# 둘레길 관심인구

In [ ]:
# Total : 44,373
# df1[(df1['연령'] == 2) | (df1['연령'] ==  3)]
df1_23 = df1[df1['연령'].isin([2, 3])]     # 17,916, 40.4%
df1_2 = df1[(df1['연령'] == 2)]            #  5,417, 12.2%
df1_3 = df1[(df1['연령'] == 3)]            # 12,499, 28.2%
df1_456 = df1[df1['연령'].isin([4, 5, 6])] # 26,457, 59.6%

In [ ]:
df1_23.head()

,길,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
6,영남알프스,영남알프스 간월재 쉽게 가는법 사진찍기좋은곳 : 네이버 블로그,M,2,NaN,NaN,,,NaN,서울,송파구,문정동,NaN
7,영남알프스,울산 억새 간월재 영남알프스 옷차림 가는방법 후기까지 : 네이버 블로그,F,2,NaN,NaN,,,NaN,서울,동대문구,전농2동,NaN
9,금오도비렁길,여수 금오도 여행. 금오도 비렁길 3코스.1박2일. 펜션숙박 : 네이버 블로그,F,3,NaN,NaN,,,NaN,경기,의정부시,낙양동,NaN
14,다산길,파주시 연다산길 62 - Daum 검색,F,2,"사무직 (일반사무직, 공무원, 직업군인)",100~199만원,아니오,,기타,충남,논산시,내동,"경차 (모닝, 스파크 등)"
15,둘레길,태안 학암포 둘레길 - Daum 검색,F,3,NaN,NaN,,,NaN,인천,중구,운서동,NaN

In [ ]:
df1_23['성별'].value_counts() # 0.3% 차이

F    9092
M    8824
Name: 성별, dtype: int64

In [ ]:
df1_23['직업'].notnull().sum(), df1_23['소득'].notnull().sum()

(10492, 10480)

In [217]:
df1_23['직업'].value_counts() # 무직, 학생, 퇴직/연금생활자, 주부

사무직 (일반사무직, 공무원, 직업군인)             3761
주부 (전업주부, 파트타임 근무 주부)              1239
학생 (초중고학생, 대학생, 대학원생)              1179
전문직 (의사, 판검사, 예술가, 종교인)             913
무직                                  671
교직 (교사, 유치원교사, 학원강사)                589
서비스직 (요식업, 숙박업, 미용실종업원)             497
생산/노무직 (생산감독, 경비원, 공장근로자)           415
기타                                  343
자영업 (도소매업, 숙박업, 미용업)                295
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        224
판매직 (상점점원, 보험설계사, 노점상)              217
관리직 (사장, 간부, 고위공무원)                 108
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      28
퇴직/연금생활자                             13
Name: 직업, dtype: int64

In [ ]:
df1_23['길'].value_counts()[:10]

둘레길       7663
서울둘레길     1541
영남알프스     1163
지리산둘레길     948
북한산둘레길     706
영덕블루로드     486
횡성호수길      423
대부해솔길      380
남해바래길      357
제주올레길      317
Name: 길, dtype: int64

In [225]:
df1_2['자동차'].value_counts().sum(), round(df1_2['자동차'].value_counts().sum() / len(df1_23) * 100, 1)

(554, 3.1)

In [149]:
len(df1_23), df1_23['시도'].value_counts().sum() # 0.76% -> 기입을 안했다.

(17916, 17780)

In [145]:
df1_23['시도'].value_counts()

서울    6137
경기    4404
부산    1097
인천    1068
대구     775
경남     678
대전     596
경북     501
광주     442
충남     425
충북     401
전북     350
울산     306
강원     286
전남     239
제주      75
Name: 시도, dtype: int64

In [ ]:
df1_23[~df1_23['결혼'].str.contains("예|아니오")]

,길,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
6,영남알프스,영남알프스 간월재 쉽게 가는법 사진찍기좋은곳 : 네이버 블로그,M,2,NaN,NaN,,,NaN,서울,송파구,문정동,NaN
7,영남알프스,울산 억새 간월재 영남알프스 옷차림 가는방법 후기까지 : 네이버 블로그,F,2,NaN,NaN,,,NaN,서울,동대문구,전농2동,NaN
9,금오도비렁길,여수 금오도 여행. 금오도 비렁길 3코스.1박2일. 펜션숙박 : 네이버 블로그,F,3,NaN,NaN,,,NaN,경기,의정부시,낙양동,NaN
15,둘레길,태안 학암포 둘레길 - Daum 검색,F,3,NaN,NaN,,,NaN,인천,중구,운서동,NaN
17,영남알프스,울산 울주군 반석촌 토종닭백숙 계곡 울산백숙 울산계곡백숙 영남알프스 : 네이버 블로그,F,2,NaN,NaN,,,NaN,경기,김포시,사우동,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
44326,지리산둘레길,지리산 둘레길 소소게스트하우스,M,2,NaN,NaN,,,NaN,서울,강남구,개포1동,NaN
44327,둘레길,자유게시판 글쓰기 | 마검포둘레길펜션,M,3,NaN,NaN,,,NaN,충북,청주시 상당구,용암1동,NaN
44330,둘레길,북한산우이역둘레길 : 네이버 통합검색,M,2,NaN,NaN,,,NaN,경기,광명시,철산동,NaN
44337,둘레길,이천 산수유 축제와 둘레길 걷기 : 네이버 블로그,M,2,NaN,NaN,,,NaN,경남,거제시,아주동,NaN
44349,지리산둘레길,'스페인 하숙' 차배진 지리산 둘레길서 산책...마늘 안까니까 손이 근질근질해 ::...,F,2,NaN,NaN,,,NaN,전북,군산시,해망동,NaN

---
---
# 둘레길 주변관광 이용자 정보

In [238]:
df2.head()

,주변관광,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,왜목마을,당진당일치기 3 왜목마을 해수욕장 산책 잠깐 들리기 좋은 코스,F,2,NaN,NaN,,,NaN,서울,강동구,명일2동,NaN
1,모악산,100대명산 모악산 84130,M,4,NaN,NaN,,,NaN,전남,화순군,화순읍,NaN
2,보덕사,보덕사 예산,M,4,NaN,NaN,,,NaN,경기,파주시,야동동,NaN
3,한탄강,포천 나들이 비둘기낭폭포 / 한탄강하늘다리 / 계류리예술창고 : 네이버 블로그,F,2,NaN,NaN,,,NaN,전북,익산시,어양동,NaN
4,증평에듀팜특구,SNS기자단 기고 해외 관광객도 즐길 충북의 명소 증평 에듀팜 관광특구,M,3,NaN,NaN,,,NaN,서울,노원구,중계2.3동,NaN

In [157]:
# Total : 9,468
df2_23 = df2[df2['연령'].isin([2, 3])]     # 4,086, 43.2%
df2_2 = df2[(df2['연령'] == 2)]            # 1,204, 12.7%
df2_3 = df2[(df2['연령'] == 3)]            # 2,882, 30.4%
df2_45 = df2[df2['연령'].isin([4, 5])]     # 5,382, 56.8%

In [180]:
df2_23[df2_23['시도'] == "서울"]['주변관광'].value_counts()[:5]

해운대    56
울릉도    47
안면도    43
한탄강    34
곽지     21
Name: 주변관광, dtype: int64

In [187]:
df2_23['성별'].value_counts() # 16.5% 차이

F    2381
M    1705
Name: 성별, dtype: int64

In [189]:
2381 / len(df2_23['성별']) * 100 - 1705 / len(df2_23['성별']) * 100

16.544297601566328

In [191]:
df2_23['직업'].notnull().sum(), df2_23['소득'].notnull().sum()

(2756, 2753)

In [194]:
df2_23['직업'].value_counts() # 무직, 학생, 주부

사무직 (일반사무직, 공무원, 직업군인)             873
주부 (전업주부, 파트타임 근무 주부)              428
무직                                 292
전문직 (의사, 판검사, 예술가, 종교인)            240
학생 (초중고학생, 대학생, 대학원생)              223
교직 (교사, 유치원교사, 학원강사)               188
자영업 (도소매업, 숙박업, 미용업)               128
서비스직 (요식업, 숙박업, 미용실종업원)            108
판매직 (상점점원, 보험설계사, 노점상)              74
생산/노무직 (생산감독, 경비원, 공장근로자)           74
기타                                  61
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        42
관리직 (사장, 간부, 고위공무원)                 19
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      6
Name: 직업, dtype: int64

In [222]:
df2_23['자동차'].value_counts().sum(), round(df2_23['자동차'].value_counts().sum() / len(df2_23) * 100, 1)

(1275, 31.2)

---
---
# 둘레길 선호 관광 장소

In [227]:
df3.head()

,선호관광,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,구곡폭포,구곡 폭포 나들이,F,4,NaN,NaN,,,NaN,서울,도봉구,쌍문동,NaN
1,불갑사,불갑사 상사화 개화초기 풍경불갑사상사화축제 날에는 만개할듯,M,5,NaN,NaN,,,NaN,경북,영천시,야사동,NaN
2,신화랑,청도 가볼만한곳 신화랑풍류마을 생각보다 알차,M,3,NaN,NaN,,,NaN,부산,부산진구,전포1동,NaN
3,태조산,천안 태조산421m 흑성산519m,F,5,NaN,NaN,,,NaN,경기,성남시 분당구,수내3동,NaN
4,복전암,토요산행 보문산,F,3,"주부 (전업주부, 파트타임 근무 주부)",900~999만원,예,자녀 있음,아파트/ 주상복합,충남,홍성군,홍성읍,"준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)"

In [229]:
# Total : 9,468 # df2랑 같네요
df3_23 = df3[df3['연령'].isin([2, 3])]     # 4,086, 43.2%
df3_2 = df3[(df3['연령'] == 2)]            # 1,204, 12.7%
df3_3 = df3[(df3['연령'] == 3)]            # 2,882, 30.4%
df3_45 = df3[df3['연령'].isin([4, 5])]     # 5,382, 56.8%

In [231]:
df3_23['자동차'].value_counts().sum(), round(df3_23['자동차'].value_counts().sum() / len(df3_23) * 100, 1)

(1275, 31.2)

In [232]:
df3_23['직업'].value_counts() # 무직, 학생, 주부

사무직 (일반사무직, 공무원, 직업군인)             873
주부 (전업주부, 파트타임 근무 주부)              428
무직                                 292
전문직 (의사, 판검사, 예술가, 종교인)            240
학생 (초중고학생, 대학생, 대학원생)              223
교직 (교사, 유치원교사, 학원강사)               188
자영업 (도소매업, 숙박업, 미용업)               128
서비스직 (요식업, 숙박업, 미용실종업원)            108
생산/노무직 (생산감독, 경비원, 공장근로자)           74
판매직 (상점점원, 보험설계사, 노점상)              74
기타                                  61
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        42
관리직 (사장, 간부, 고위공무원)                 19
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      6
Name: 직업, dtype: int64

In [233]:
df3_23['성별'].value_counts() # 16.5% 차이

F    2381
M    1705
Name: 성별, dtype: int64

In [235]:
df3_23['선호관광'].value_counts()[:5]

울릉도    268
해운대    213
남원     112
안면도     84
죽도      77
Name: 선호관광, dtype: int64

---
---
# 둘레길 관심인구 관심사/관심분야 (포털 검색 분야) 정보

In [240]:
df4.head()

,주요관심,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,사회,`내기 골프 논란`... :: 네이버 뉴스,M,4,NaN,NaN,,,NaN,서울,영등포구,문래동3가,NaN
1,사회,해외야구 : 네이버 스포츠,F,5,NaN,NaN,,,NaN,경기,의정부시,신곡1동,NaN
2,TV연예,[단독] “VIP가 ... :: 네이버 뉴스,M,5,"기능직 (자동차정비, 운전기사, 안경사, 택시기사)",300~399만원,아니오,,연립주택/ 다세대/ 빌라,서울,종로구,창신2동,NaN
3,경제,네이버 뉴스,M,3,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,아니오,,아파트/ 주상복합,서울,구로구,고척2동,NaN
4,사회,[단독] 음주운전... :: 네이버 뉴스,M,3,NaN,NaN,,,NaN,경남,김해시,진영읍,NaN

In [244]:
df4['연령'].value_counts().sum() - 14883 - 50129

91504

In [242]:
# Total : 156,516
df4_23 = df4[df4['연령'].isin([2, 3])]     # 65,012, 41.5%
df4_2 = df4[(df4['연령'] == 2)]            # 14,883, 9.5%
df4_3 = df4[(df4['연령'] == 3)]            # 50,129, 32.0%
df4_456 = df4[df4['연령'].isin([4, 5, 6])] # 91,504, 58.5%

In [287]:
df4_23['성별'].value_counts()

F    38858
M    26154
Name: 성별, dtype: int64

In [253]:
df4_23['시도'].value_counts()[:5]

서울    22181
경기    16580
인천     4836
경남     3778
대구     3476
Name: 시도, dtype: int64

In [251]:
df4_23[df4_23['시도'] == "서울"]['주요관심'].value_counts()[:5]

TV연예    7768
사회      6825
스포츠     4745
경제      1593
정치       573
Name: 주요관심, dtype: int64

In [312]:
df4_2[df4_2['시도'] == "경기"]['주요관심'].value_counts()[:5]

사회      2141
정치       933
TV연예     752
스포츠      460
경제       205
Name: 주요관심, dtype: int64

In [259]:
df4_23['자동차'].value_counts().sum(), round(df4_23['자동차'].value_counts().sum() / len(df4_23) * 100, 1)

(25614, 39.4)

In [260]:
df4_23['자동차'].value_counts()

준중형차 (아반떼, K3, 크루즈, 제타급 등)          7078
중형차 (쏘나타, K5, 말리부, 골프급 등)           5635
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)    3526
경차 (모닝, 스파크 등)                      3419
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)      1585
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)    1165
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         717
소형SUV/CUV (티볼리, QM3 등)               634
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         507
대형SUV (베라크루즈, 모하비, 투아렉급 등)           483
대형차 (제너시스, BMW5급 등)                  310
기타 (승합차/트럭/화물차/기타 차량 등)              232
준중형파생 (벨로스터, I30 등)                  220
프리미엄 (에쿠스, BMW7급 등)                   46
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        35
중형파생 (I40 등)                          22
Name: 자동차, dtype: int64

In [266]:
df4_23['직업'].value_counts() # 무직, 주부, 퇴직/연금생활자, 학생

사무직 (일반사무직, 공무원, 직업군인)             16766
주부 (전업주부, 파트타임 근무 주부)               8105
학생 (초중고학생, 대학생, 대학원생)               5290
자영업 (도소매업, 숙박업, 미용업)                4282
전문직 (의사, 판검사, 예술가, 종교인)             3774
교직 (교사, 유치원교사, 학원강사)                3302
무직                                  2783
생산/노무직 (생산감독, 경비원, 공장근로자)           1505
서비스직 (요식업, 숙박업, 미용실종업원)             1225
기타                                   799
판매직 (상점점원, 보험설계사, 노점상)               762
기능직 (자동차정비, 운전기사, 안경사, 택시기사)         697
관리직 (사장, 간부, 고위공무원)                  186
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)       52
퇴직/연금생활자                              34
Name: 직업, dtype: int64

# 둘레길 관심인구 라이프스타일 (온라인쇼핑몰 이용 카테고리 정보)

In [275]:
df5.head()

,카테고리,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,레저/자동차,F,4,"서비스직 (요식업, 숙박업, 미용실종업원)",700~799만원,아니오,,단독주택,서울,도봉구,쌍문1동,NaN
1,레저/자동차,F,4,"서비스직 (요식업, 숙박업, 미용실종업원)",700~799만원,아니오,,단독주택,서울,도봉구,쌍문1동,NaN
2,레저/자동차,F,4,"서비스직 (요식업, 숙박업, 미용실종업원)",700~799만원,아니오,,단독주택,서울,도봉구,쌍문1동,NaN
3,패션의류,F,2,NaN,NaN,,,NaN,경기,의정부시,의정부1동,NaN
4,패션의류,F,2,NaN,NaN,,,NaN,경기,의정부시,의정부1동,NaN

In [278]:
# Total : 68,606
df5_23 = df5[df5['연령'].isin([2, 3])]     # 32,292, 47.1%
df5_2 = df5[(df5['연령'] == 2)]            # 8,887, 13.0%
df5_3 = df5[(df5['연령'] == 3)]            # 23,405, 34.1%
df5_45 = df5[df5['연령'].isin([4, 5])]     # 36,314, 52.9%

In [286]:
df5_23['성별'].value_counts()

F    21268
M    11024
Name: 성별, dtype: int64

In [292]:
df5_23['직업'].value_counts() # 학생, 주부, 무직, 퇴직/연금생활자

사무직 (일반사무직, 공무원, 직업군인)             9768
주부 (전업주부, 파트타임 근무 주부)              4534
학생 (초중고학생, 대학생, 대학원생)              1573
교직 (교사, 유치원교사, 학원강사)               1544
전문직 (의사, 판검사, 예술가, 종교인)            1461
무직                                 1208
서비스직 (요식업, 숙박업, 미용실종업원)             824
생산/노무직 (생산감독, 경비원, 공장근로자)           627
판매직 (상점점원, 보험설계사, 노점상)              606
기타                                  446
자영업 (도소매업, 숙박업, 미용업)                419
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        271
관리직 (사장, 간부, 고위공무원)                 131
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      32
퇴직/연금생활자                             12
Name: 직업, dtype: int64

In [302]:
round(16129/len(df5_23) * 100, 1),\
round(3851/len(df5_23) * 100, 1),\
round(12278/len(df5_23) * 100, 1)

(49.9, 11.9, 38.0)

In [295]:
df5_23['직업'].value_counts().sum() -4534 -1573 - 1208 -12

16129

In [306]:
df5_23['자동차'].value_counts().sum(), round(df5_23['자동차'].value_counts().sum()/len(df5_23) * 100, 1),\
df5_2['자동차'].value_counts().sum(), round(df5_2['자동차'].value_counts().sum()/len(df5_23) * 100, 1),\
df5_3['자동차'].value_counts().sum(), round(df5_3['자동차'].value_counts().sum()/len(df5_23) * 100, 1),

(10957, 33.9, 647, 2.0, 10310, 31.9)

In [309]:
df5_23['시도'].value_counts()[:5],\
df5_2['시도'].value_counts()[:5],\
df5_3['시도'].value_counts()[:5]

(서울    9733
 경기    7757
 부산    4069
 대구    2277
 인천    1800
 Name: 시도, dtype: int64,
 부산    2832
 서울    2009
 경기    1528
 인천     392
 대구     282
 Name: 시도, dtype: int64,
 서울    7724
 경기    6229
 대구    1995
 인천    1408
 부산    1237
 Name: 시도, dtype: int64)

In [311]:
df5_23[df5_23['시도'] == "서울"]['카테고리'].value_counts()[:5],\
df5_2[df5_2['시도'] == "부산"]['카테고리'].value_counts()[:5],\
df5_3[df5_3['시도'] == "서울"]['카테고리'].value_counts()[:5]

(식품/건강    2920
 패션의류     1910
 생활/주방    1174
 뷰티       1039
 패션잡화      999
 Name: 카테고리, dtype: int64,
 패션의류      2272
 패션잡화       307
 식품/건강       90
 뷰티          68
 디지털/가전      49
 Name: 카테고리, dtype: int64,
 식품/건강    2530
 패션의류     1512
 생활/주방     864
 뷰티        814
 패션잡화      791
 Name: 카테고리, dtype: int64)